package com.nicname.iyeongjun.dobike.const

import com.google.gson.Gson
import com.nicname.iyeongjun.dobike.api.model.section.SectionModel


val sectionJson = """
     {
  "items" : [
  {
    "section": "강서구",
    "lat": "37.567960999999997",
    "long": "126.81688800000001"
  },
  {
    "section": "양천구",
    "lat": "37.522936000000001",
    "long": "126.85930999999999"
  },
  {
    "section": "구로구",
    "lat": "37.499023999999999",
    "long": "126.854609"
  },
  {
    "section": "금천구",
    "lat": "37.460667999999998",
    "long": "126.902726"
  },
  {
    "section": "관악구",
    "lat": "37.478934000000002",
    "long": "126.936013"
  },
  {
    "section": "영등포구",
    "lat": "37.517831000000001",
    "long": "126.904742"
  },
  {
    "section": "마포구",
    "lat": "37.558318",
    "long": "126.914306"
  },
  {
    "section": "서대문구",
    "lat": "37.578141000000002",
    "long": "126.92930800000001"
  },
  {
    "section": "은평구",
    "lat": "37.609751000000003",
    "long": "126.91856199999999"
  },
  {
    "section": "동작구",
    "lat": "37.505000000000003",
    "long": "126.948502"
  },
  {
    "section": "용산구",
    "lat": "37.535691999999997",
    "long": "126.966548"
  },
  {
    "section": "중구",
    "lat": "37.563046999999997",
    "long": "126.99485300000001"
  },
  {
    "section": "종로구",
    "lat": "37.584443999999998",
    "long": "126.980656"
  },
  {
    "section": "서초구",
    "lat": "37.485419999999998",
    "long": "127.01471600000001"
  },
  {
    "section": "강남구",
    "lat": "37.502971000000002",
    "long": "127.05334999999999"
  },
  {
    "section": "성동구",
    "lat": "37.558495999999998",
    "long": "127.03634700000001"
  },
  {
    "section": "동대문구",
    "lat": "37.579968000000001",
    "long": "127.052869"
  },
  {
    "section": "성북구",
    "lat": "37.599465000000002",
    "long": "127.01854"
  },
  {
    "section": "강북구",
    "lat": "37.632707000000003",
    "long": "127.02069"
  },
  {
    "section": "도봉구",
    "lat": "37.659424999999999",
    "long": "127.03913900000001"
  },
  {
    "section": "노원구",
    "lat": "37.645625000000003",
    "long": "127.067868"
  },
  {
    "section": "중랑구",
    "lat": "37.592871000000002",
    "long": "127.09089899999999"
  },
  {
    "section": "광진구",
    "lat": "37.543683000000001",
    "long": "127.08810200000001"
  },
  {
    "section": "송파구",
    "lat": "37.508271999999998",
    "long": "127.11206300000001"
  },
  {
    "section": "강동구",
    "lat": "37.543582000000001",
    "long": "127.139303"
  }
]
}
""".trimIndent()


val sections = Gson().fromJson(sectionJson, SectionModel::class.java)